Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.WallNotCoveredByRoof
The highlighted wall(s) cannot be joined to the highlighted roof because the roof does not entirely cover the wall(s).

Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.WallMeetsRoofTangentially
The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.

Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NotCoveredAtAllByTarget
Highlighted walls are attached to, but miss, the highlighted targets.

Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NoUptoRoofForWall
Highlighted wall is set to be "Up to roof", however there is no roof above it that can be used.

Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NoFromRoofForWall
Highlighted wall is set to be "From roof", however there is no roof below it that can be used.

Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures
Failures about WallJoinRoof.